; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-15)
(:domain gripper-strips)
(:objects rooma roomb left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 )
(:init
(room rooma)
(room roomb)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 12 of 15
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 12 of 15
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 15
4. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 13 of 15
5. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 14 of 15
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 14 of 15
7. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 14 of 15
8. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 15
9. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 15 of 15
